perf/results/cassandra/read_200rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 2.150ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.980ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.35ms    4.52ms  92.74ms   98.24%
    Req/Sec   108.38    110.57     1.11k    79.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.86ms
 75.000%    2.38ms
 90.000%    2.98ms
 99.000%    9.83ms
 99.900%   83.26ms
 99.990%   92.80ms
 99.999%   92.80ms
100.000%   92.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.205     0.000000            1         1.00
       1.086     0.100000          398         1.11
       1.324     0.200000          799         1.25
       1.524     0.300000         1196         1.43
       1.700     0.400000         1593         1.67
       1.865     0.500000         1990         2.00
       1.949     0.550000         2191         2.22
       2.043     0.600000         2389         2.50
       2.155     0.650000         2590         2.86
       2.253     0.700000         2787         3.33
       2.385     0.750000         2986         4.00
       2.459     0.775000         3085         4.44
       2.537     0.800000         3186         5.00
       2.615     0.825000         3285         5.71
       2.711     0.850000         3385         6.67
       2.829     0.875000         3483         8.00
       2.901     0.887500         3533         8.89
       2.985     0.900000         3583        10.00
       3.123     0.912500         3632        11.43
       3.269     0.925000         3682        13.33
       3.563     0.937500         3732        16.00
       3.725     0.943750         3757        17.78
       4.007     0.950000         3781        20.00
       4.299     0.956250         3806        22.86
       4.627     0.962500         3831        26.67
       5.055     0.968750         3856        32.00
       5.239     0.971875         3869        35.56
       5.603     0.975000         3881        40.00
       5.867     0.978125         3893        45.71
       6.479     0.981250         3906        53.33
       7.259     0.984375         3918        64.00
       8.119     0.985938         3925        71.11
       8.823     0.987500         3932        80.00
       9.623     0.989062         3937        91.43
       9.895     0.990625         3943       106.67
      11.543     0.992188         3949       128.00
      12.663     0.992969         3953       142.22
      13.879     0.993750         3956       160.00
      14.695     0.994531         3959       182.86
      16.279     0.995313         3962       213.33
      19.071     0.996094         3965       256.00
      26.831     0.996484         3967       284.44
      31.087     0.996875         3968       320.00
      67.455     0.997266         3970       365.71
      70.655     0.997656         3971       426.67
      75.135     0.998047         3973       512.00
      77.311     0.998242         3974       568.89
      77.311     0.998437         3974       640.00
      80.895     0.998633         3975       731.43
      83.263     0.998828         3976       853.33
      86.335     0.999023         3977      1024.00
      86.335     0.999121         3977      1137.78
      86.335     0.999219         3977      1280.00
      86.975     0.999316         3978      1462.86
      86.975     0.999414         3978      1706.67
      90.943     0.999512         3979      2048.00
      90.943     0.999561         3979      2275.56
      90.943     0.999609         3979      2560.00
      90.943     0.999658         3979      2925.71
      90.943     0.999707         3979      3413.33
      92.799     0.999756         3980      4096.00
      92.799     1.000000         3980          inf
#[Mean    =        2.345, StdDeviation   =        4.522]
#[Max     =       92.736, Total count    =         3980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 1.05MB read
  Non-2xx or 3xx responses: 474
Requests/sec:    200.04
Transfer/sec:     35.95KB